import React from "react";
import Reviews from "../../components/Reviews";
import BlogNav from "../../components/BlogNav";
// import ReadMoreBlog from "../pages/ReadMoreBlog";
import background from "../../img/other/unsplash_ZEy7KSeKIIk.png";

function SingleBlog() {
  var bgSingleBlog = {
    backgroundImage: `url(${background})`,
  };
  const [textSingleBlog, settextSingleBlog] = React.useState([
    {
      text1:
        "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است",
    },
    {
      text2:
        "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است",
    },
    {
      text3:
        "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است",
    },
    {
      text4:
        "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است",
    },
    {
      text5:
        "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است",
    },
    {
      text6:
        "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است",
    },
  ]);
  const titleSingleBlog = [
    {
      titleSingle: "مزایای خرید گیفت کارت",
      captionSingle:
        "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است",
    },
  ];
  return (
    <>
      <section>
        <div className="bg-Sblog" style={bgSingleBlog}>
          <div className="caption-header-blog">
            {titleSingleBlog.map((item, idx) => {
              return (
                <div key={idx}>
                  <h3>{item.titleSingle}</h3>
                  <p>{item.captionSingle}</p>
                </div>
              );
            })}
          </div>
        </div>
      </section>
      <section>
        <div className="container-fluid py-5">
          <div className="row align-items-start">
            <div className="col-md-3">
              <BlogNav />
            </div>
            <div className="col-md-9">
              {/* {blogPosts.map((item, idx) => {
                return (
                  <div className="col-md-6 col-lg-4 col-12 p-2" key={idx}>
                    <BlogPost data={item} />
                  </div>
                );
              })} */}
              <div className="text-single-blog">
                <div className="caption-header-blog">
                  <h4>مزایای خرید گیفت کارت</h4>
                </div>
                <div className="more-text-single-blog">
                  {textSingleBlog.map((item, idx) => {
                    return (
                      <div>
                        <p>{item.text1}</p>
                        <p>{item.text2}</p>
                        <p>{item.text3}</p>
                        <p>{item.text4}</p>
                        <p>{item.text5}</p>
                        <p>{item.text6}</p>
                      </div>
                    );
                  })}
                </div>
              </div>

              <div className="review-section">
                <Reviews />
                {/* <ReadMoreBlog /> */}
              </div>
            </div>
          </div>
        </div>
      </section>
    </>
  );
}

export default SingleBlog;
